Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralT.GetWebThicknessInHeightCenter
Returns thickness of web measured in the 0.5 * height,
Since:
2018

Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralT.GetFlangeThicknessInFlangeCenter
Returns thickness of flange measured in the 0.25 * (width - webThickess),
sometimes used for sections with width > 300 mm.
Since:
2018

Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralT.GetFlangeThicknessInQuarterWidth
Returns thickness of flange measured in the 0.25 * width,
sometimes used for sections with width <= 300 mm.
Since:
2018

Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralT.SlopedWebAngle
Sloped web angle. (rad)
Since:
2018

Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralT.WebToeOfFillet
Detailing distance from outer face of flange to web toe of fillet, in. (mm)
Since:
2018

Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralT.TopWebFillet
Top Web Fillet - fillet radius at the top of web.
Since:
2018

Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralT.SlopedFlangeAngle
Sloped flange angle. (rad)
Since:
2018

Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralT.FlangeToeOfFillet
Detailing distance from center of web to flange toe of fillet, in. (mm)
Since:
2018

Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralT.FlangeFillet
Flange Fillet - fillet radius at the flange end.
Since:
2018

Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralT.#ctor(System.Double,System.Double,System.Double,System.Double,System.Double,System.Double,System.Double,System.Double,System.Double,System.Double,System.Double,System.Double,System.Double,System.Double,System.Double,Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionAnalysisParams)
Creates a new instance of Tees shape.
width:
Section width.
height:
Section height, depth.
flangeThickness:
Flange Thickness.
flangeThicknessLocation:
Flange Thickness Location.
flangeFillet:
Flange Fillet - fillet radius at the flange end.
flangeToeOfFillet:
Detailing distance from center of web to flange toe of fillet, in. (mm)
slopedFlangeAngle:
Sloped flange angle. (rad)
webThickness:
Web Thickness.
webThicknessLocation:
Web Thickness Location.
webFillet:
Web Fillet - fillet radius between web and flange.
topWebFillet:
Top Web Fillet - fillet radius at the top of web.
webToeOfFillet:
Detailing distance from outer face of flange to web toe of fillet, in. (mm)
slopedWebAngle:
Sloped web angle. (rad)
centroidHorizontal:
Distance from centroid to the left extremites along horizontal axis.
centroidVertical:
Distance from centroid to the upper extremites along vertical axis.
analysisParams:
Common set of parameters for structural analysis.
Since:
2018

Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralT
Defines parameters for Tees shape.
Since:
2018